[
  {
    "name": "Blåbär Nordic Living",
    "img": "./images/blabar.jpg",
    "link": "https://blabar.london",
    "about": "I was tasked with enhancing the user experience and optimizing the layout of the website, which is currently hosted on the Shopify platform and utilizes the Liquid template language. In addition to these improvements, I was responsible for modernizing the theme, transitioning it from a vintage aesthetic to the sleek and advanced Shopify 2.0 theme."
  },
  {
    "name": "Portfolio of Wilma Enström",
    "img": "./images/wilmaenstrom.jpg",
    "link": "https://github.com/tovehydmark/wilmaenstrom-portfolio",
    "about": "This portfolio has been developed in Next.js for the artist Wilma Enström. The project includes a site that users will be able to visit as well as an admin page where an admin can manage the content of the site. The project is under development and is yet not deployed."
  },
  {
    "name": "Paragon Collective",
    "img": "./images/paragon-collective.png",
    "link": "https://www.paragoncaps.com/password",
    "about": "Designing and building an ecommerce store in Shopify. I am custom building the theme based on a design in Figma. The shop is under construction."
  },
  {
    "name": "Fridas Fina AB",
    "img": "./images/Fridasfina.png",
    "link": "https://fridasfina.se/",
    "about": "Designed and built a simple one-page site as a substitute for a closed down ecommerce shop. Deployed the site on Netlify and connected the old domain to the new site."
  },
  {
    "name": "Noble Crafts Ltd.",
    "img": "./images/noblecraftsltd.jpg",
    "link": "https://www.noblecrafts.life/",
    "about": "Built the consultancy website in Wix and created the design based on the clients' wishes and feedback. I also set up the domain and deployed the site. I am also helping the client with email marketing by setting up, building and designing email flows and campaigns in Klaviyo."
  },
  {
    "name": "pluggaTech",
    "img": "./images/plugga.tech.jpg",
    "link": "https://plugga.tech",
    "about": "I worked on the site Plugga.tech during my internship at HiveAndFive. Plugga.tech is an educational platform with video content created for web developers. I worked on developing new features, designed and implemented functionality and fixed bugs. The project is written in Next.js with TypeScript and tests were written in Cypress."
  },
  {
    "name": "pluggaTech - Graduation project",
    "img": "./images/graduation-project.jpg",
    "link": "https://plugga.tech",
    "about": "I created a feature on the site Plugga.tech as my graduation project. The feature is an internship application platform where businesses and students can create accounts. On the site, business can post internship vacancies that students can apply for. The feature is not yet launched but will be hosted on the platform plugga.tech."
  },
  {
    "name": "adventureHero",
    "img": "./images/adventurehero.jpg",
    "link": "https://adventurehero.se",
    "about": "I've worked on the site Adventurehero.se during my internship as a frontend developer at HiveAndFive. Adventurehero is a booking system where businesses can advertise and manage events and activities that anyone can book. During the internship, I have developed new features from creating designs in Figma, having meetings with the customer, to implementing the feature in code. The project is written in React.js with TypeScript and Node.js."
  },
  {
    "name": "portfolio-website",
    "img": "./images/portfolio-website.png",
    "link": "https://tovehydmark.dev",
    "githubLink": "https://github.com/tovehydmark/portfolio",
    "about": "On this site, I host some of my projects and outline my experiences and contact details. The project is built in React and deployed at Netlify."
  },
  {
    "name": "movie-webshop",
    "img": "./images/movie-webshop.jpg",
    "link": "https://tovehydmark.github.io/angular-webshop/webshop/",
    "githubLink": "https://github.com/tovehydmark/angular-webshop",
    "about": "I created this webshop whilst learning JavaScript at Medieinstitutet. It is written in Angular and TypeScript."
  },
  {
    "name": "readingRivalry",
    "img": "./images/reading-rivalry.jpg",
    "link": "https://tovehydmark.github.io/book-challenge-design/",
    "githubLink": "https://github.com/tovehydmark/book-challenge-design",
    "about": "Reading Rivalry is my design created for a school project. The purpose of the assignment was to create a design and swap it with a fellow class mate to code your friends design."
  },
  {
    "name": "newsletter",
    "img": "./images/newsletter.jpg",
    "link": "https://tovehydmark.github.io/frontend-do-you-want-my-newsletter/#/",
    "githubLink": "https://github.com/tovehydmark/frontend-do-you-want-my-newsletter",
    "about": "A project I made early on whilst learning React.js and Node.js. The aim was to deleop a page where a user can create an account and decide whether or not they want to sign up for a newsletter."
  },
  {
    "name": "login-page",
    "img": "./images/login-page.jpg",
    "link": "https://tovehydmark.github.io/login-page-vanilla-js/",
    "githubLink": "https://github.com/tovehydmark/login-page-vanilla-js",
    "about": "This is a simple login page I wrote whilst learning vanillaJS. The application is using local storage to store the data."
  },
  {
    "name": "cv-site",
    "img": "./images/cv-site.jpg",
    "link": "https://tovehydmark.github.io/cv-site/",
    "githubLink": "https://github.com/tovehydmark/cv-site",
    "about": "When learning HTML and CSS, I created this CV site. The content on the site has not been updated since but please have a look if you want anyway :)"
  },
  {
    "name": "restaurant",
    "img": "./images/codfather.jpg",
    "link": "https://spontaneous-elf-ec9ee9.netlify.app/",
    "githubLink": "https://github.com/tovehydmark/restaurange",
    "about": "The Codfather is a fictive restaurant I created together with few classmates using React.js. The main feature is the booking system making it possible to book a table at the restaurant."
  }
]
